import React, { useState } from 'react'
import Predlagat from './predlagat'

const BigCarousel = () => {
    const [startData, setStartData] = useState([
        {
            name: "Бильярд",
            items: [
                {
                    "image": "Аксессуары.jpg",
                    "name": "Аксессуары для стола",
                    "link": true
                },
                {
                    "image": "Тубусы.jpg",
                    "name": "Чехлы, тубусы для киев",
                    "link": true
                },
                {
                    "image": "Сукно.jpg",
                    "name": "Сукно",
                    "link": true
                },
                {
                    "image": "Комплектующие.jpg",
                    "name": "Комплектующие",
                    "link": true
                },
                {
                    "image": "Коллекции.jpg",
                    "name": "Бильярдные коллекции",
                    "link": true
                },
                {
                    "image": "tables_billiard_main.jpg",
                    "name": "Бильярдные столы",
                    "link": true
                },
                {
                    "image": "Светильники_02.jpg",
                    "name": "Светильники",
                    "link": true
                },
                {
                    "image": "Кии_03.jpg",
                    "name": "Кии",
                    "link": true
                },
                {
                    "image": "Шары.jpg",
                    "name": "Шары",
                    "link": true
                },
                {
                    "image": "Blue_Knight_50_13_14_01.jpg",
                    "name": "Наклейки, колпачки для кия",
                    "link": true
                },
                {
                    "image": "Аксессуары.jpg",
                    "name": "Аксессуары для стола",
                    "link": true
                },
                {
                    "image": "Тубусы.jpg",
                    "name": "Чехлы, тубусы для киев",
                    "link": true
                },
                {
                    "image": "Сукно.jpg",
                    "name": "Сукно",
                    "link": true
                },
                {
                    "image": "Комплектующие.jpg",
                    "name": "Комплектующие",
                    "link": true
                },
                {
                    "image": "Коллекции.jpg",
                    "name": "Бильярдные коллекции",
                    "link": true
                },
                {
                    "image": "tables_billiard_main.jpg",
                    "name": "Бильярдные столы",
                    "link": true
                },
                {
                    "image": "Светильники_02.jpg",
                    "name": "Светильники",
                    "link": true
                },
                {
                    "image": "Кии_03.jpg",
                    "name": "Кии",
                    "link": true
                }
            ]
        }, {
            name: "Игротека",
            items: [
                {
                    "image": "7e6ba6872b5d99bc01f2aebb2977123a.jpg",
                    "name": "\n                                                        Olympic Optima – новый теннисный стол, отличный от стандартов!                                                    ",
                    "link": true
                },
                {
                    "image": "2020_Home_00.jpg",
                    "name": "\n                                                        Home  - новый профессиональный мини-футбол!                                                    ",
                    "link": true
                },
                {
                    "image": "2020_Tournament_06.jpg",
                    "name": "\n                                                        Tournament  -  большой мини-футбол профессионального уровня!                                                    ",
                    "link": true
                },
                {
                    "image": "Perfect-SLF-JK30.jpg",
                    "name": "\n                                                        Беговая дорожка Perfect в сложенном виде занимает минимум пространства!                                                    ",
                    "link": true
                },
                {
                    "image": "Ice_transform_SLP_00.jpg",
                    "name": "\n                                                        Transform Ice. Популярная модель компактного аэрохоккея                                                    ",
                    "link": true
                },
                {
                    "image": "Ice_Arena-6_SLP-6030-1_заставка.jpg",
                    "name": "\n                                                        Аэрохоккей ICE ARENA 7. Большой стол в современном дизайне                                                    ",
                    "link": true
                },
                {
                    "image": "Universal-SLP-1225_00.jpg",
                    "name": "\n                                                        Аэрохоккей + Бильярд. Universal. Популярная модель компактного игрового стола                                                    ",
                    "link": true
                },
                {
                    "image": "2018_SLP_Elit-Play_BL-1818A_01.jpg",
                    "name": "\n                                                        Профессиональный дартс SLP Elit-Play по выгодной цене                                                    ",
                    "link": true
                },
                {
                    "image": "Premium-SLP-1469_06.jpg",
                    "name": "\n                                                        Мини-футбол Premium. Профессионал, который украсит любой интерьер                                                    ",
                    "link": true
                },
                {
                    "image": "7e6ba6872b5d99bc01f2aebb2977123a.jpg",
                    "name": "\n                                                        Olympic Optima – новый теннисный стол, отличный от стандартов!                                                    ",
                    "link": true
                },
                {
                    "image": "2020_Home_00.jpg",
                    "name": "\n                                                        Home  - новый профессиональный мини-футбол!                                                    ",
                    "link": true
                },
                {
                    "image": "2020_Tournament_06.jpg",
                    "name": "\n                                                        Tournament  -  большой мини-футбол профессионального уровня!                                                    ",
                    "link": true
                },
                {
                    "image": "Perfect-SLF-JK30.jpg",
                    "name": "\n                                                        Беговая дорожка Perfect в сложенном виде занимает минимум пространства!                                                    ",
                    "link": true
                },
                {
                    "image": "Ice_transform_SLP_00.jpg",
                    "name": "\n                                                        Transform Ice. Популярная модель компактного аэрохоккея                                                    ",
                    "link": true
                },
                {
                    "image": "Ice_Arena-6_SLP-6030-1_заставка.jpg",
                    "name": "\n                                                        Аэрохоккей ICE ARENA 7. Большой стол в современном дизайне                                                    ",
                    "link": true
                },
                {
                    "image": "Universal-SLP-1225_00.jpg",
                    "name": "\n                                                        Аэрохоккей + Бильярд. Universal. Популярная модель компактного игрового стола                                                    ",
                    "link": true
                },
                {
                    "image": "2018_SLP_Elit-Play_BL-1818A_01.jpg",
                    "name": "\n                                                        Профессиональный дартс SLP Elit-Play по выгодной цене                                                    ",
                    "link": true
                }
            ]
        }, {
            name: "Интерьер",
            items: [
                {
                    "image": "Предметы_мебели_03.jpg",
                    "name": "Предметы мебели",
                    "link": true
                },
                {
                    "image": "Мебельные-модули_02.jpg",
                    "name": "Мебельные модули",
                    "link": true
                },
                {
                    "image": "Мебельные_коллекции.jpg",
                    "name": "Мебельные коллекции",
                    "link": true
                },
                {
                    "image": "Интерьерные-панели.jpg",
                    "name": "Интерьерные панели",
                    "link": true
                },
                {
                    "image": "Кесонные_потолки.jpg",
                    "name": "Кессонный потолок",
                    "link": true
                },
                {
                    "image": "Предметы_мебели_03.jpg",
                    "name": "Предметы мебели",
                    "link": true
                },
                {
                    "image": "Мебельные-модули_02.jpg",
                    "name": "Мебельные модули",
                    "link": true
                },
                {
                    "image": "Мебельные_коллекции.jpg",
                    "name": "Мебельные коллекции",
                    "link": true
                },
                {
                    "image": "Интерьерные-панели.jpg",
                    "name": "Интерьерные панели",
                    "link": true
                },
                {
                    "image": "Кесонные_потолки.jpg",
                    "name": "Кессонный потолок",
                    "link": true
                },
                {
                    "image": "Предметы_мебели_03.jpg",
                    "name": "Предметы мебели",
                    "link": true
                },
                {
                    "image": "Мебельные-модули_02.jpg",
                    "name": "Мебельные модули",
                    "link": true
                },
                {
                    "image": "Мебельные_коллекции.jpg",
                    "name": "Мебельные коллекции",
                    "link": true
                }
            ]
        }
    ])

    const [onlineShoppin, setOnlineShopping] = useState([
        {
            name: "Бильярд",
            items: [
                {
                    "image": "Домашний_люксII.jpg",
                    "name": "\n                                                        «Домашний Люкс» - прекрасный выбор для загородного дома или квартиры.                                                    ",
                    "link": true
                },
                {
                    "image": "Барон.jpg",
                    "name": "\n                                                        «Барон». На этом столе был установлен мировой рекорд. Хит продаж в профессиональном сегменте                                                    ",
                    "link": true
                },
                {
                    "image": "Домашний.jpg",
                    "name": "\n                                                        «Домашний» – эталон практичного и бюджетного домашнего бильярда                                                     ",
                    "link": true
                },
                {
                    "image": "Классик.jpg",
                    "name": "\n                                                        «Классик» – стол на все времена со скидкой по беспрецедентной акции!                                                    ",
                    "link": true
                },
                {
                    "image": "Версаль_02.jpg",
                    "name": "\n                                                        «Версаль». Официальный стол  BetBoom Кубка Чемпионов - 2022-23 / Чемпионата мира - 2023  / Чемпионата России - 2023                                                    ",
                    "link": true
                },
                {
                    "image": "Tb_Fusion.jpg",
                    "name": "\n                                                        Fusion - современный бильярдный стол высоких технологий                                                    ",
                    "link": true
                },
                {
                    "image": "Президент-III-Прайм.jpg",
                    "name": "\n                                                        «Президент III Прайм». Официальный стол Кубка мира-2023. «Кубка Главы Екатеринбурга»                                                    ",
                    "link": true
                },
                {
                    "image": "Ливерпуль.jpg",
                    "name": "\n                                                        «Ливерпуль» - легендарный бильярдный стол по выгодной цене от производителя                                                    ",
                    "link": true
                },
                {
                    "image": "Олимп.jpg",
                    "name": "\n                                                        «Олимп» -вершина модельного ряда столов любительской серии                                                     ",
                    "link": true
                },
                {
                    "image": "Домашний_люксII.jpg",
                    "name": "\n                                                        «Домашний Люкс» - прекрасный выбор для загородного дома или квартиры.                                                    ",
                    "link": true
                },
                {
                    "image": "Барон.jpg",
                    "name": "\n                                                        «Барон». На этом столе был установлен мировой рекорд. Хит продаж в профессиональном сегменте                                                    ",
                    "link": true
                },
                {
                    "image": "Домашний.jpg",
                    "name": "\n                                                        «Домашний» – эталон практичного и бюджетного домашнего бильярда                                                     ",
                    "link": true
                },
                {
                    "image": "Классик.jpg",
                    "name": "\n                                                        «Классик» – стол на все времена со скидкой по беспрецедентной акции!                                                    ",
                    "link": true
                },
                {
                    "image": "Версаль_02.jpg",
                    "name": "\n                                                        «Версаль». Официальный стол  BetBoom Кубка Чемпионов - 2022-23 / Чемпионата мира - 2023  / Чемпионата России - 2023                                                    ",
                    "link": true
                },
                {
                    "image": "Tb_Fusion.jpg",
                    "name": "\n                                                        Fusion - современный бильярдный стол высоких технологий                                                    ",
                    "link": true
                },
                {
                    "image": "Президент-III-Прайм.jpg",
                    "name": "\n                                                        «Президент III Прайм». Официальный стол Кубка мира-2023. «Кубка Главы Екатеринбурга»                                                    ",
                    "link": true
                },
                {
                    "image": "Ливерпуль.jpg",
                    "name": "\n                                                        «Ливерпуль» - легендарный бильярдный стол по выгодной цене от производителя                                                    ",
                    "link": true
                }
            ]
        }, {
            name: "Игротека",
            items: [
                {
                    "image": "7e6ba6872b5d99bc01f2aebb2977123a.jpg",
                    "name": "Olympic Optima – новый теннисный стол, отличный от стандартов!",
                    "link": true
                },
                {
                    "image": "2020_Home_00.jpg",
                    "name": "\n                                                        Home  - новый профессиональный мини-футбол!                                                    ",
                    "link": true
                },
                {
                    "image": "2020_Tournament_06.jpg",
                    "name": "\n                                                        Tournament  -  большой мини-футбол профессионального уровня!                                                    ",
                    "link": true
                },
                {
                    "image": "Perfect-SLF-JK30.jpg",
                    "name": "\n                                                        Беговая дорожка Perfect в сложенном виде занимает минимум пространства!                                                    ",
                    "link": true
                },
                {
                    "image": "Ice_transform_SLP_00.jpg",
                    "name": "\n                                                        Transform Ice. Популярная модель компактного аэрохоккея                                                    ",
                    "link": true
                },
                {
                    "image": "Ice_Arena-6_SLP-6030-1_заставка.jpg",
                    "name": "\n                                                        Аэрохоккей ICE ARENA 7. Большой стол в современном дизайне                                                    ",
                    "link": true
                },
                {
                    "image": "Universal-SLP-1225_00.jpg",
                    "name": "\n                                                        Аэрохоккей + Бильярд. Universal. Популярная модель компактного игрового стола                                                    ",
                    "link": true
                },
                {
                    "image": "2018_SLP_Elit-Play_BL-1818A_01.jpg",
                    "name": "\n                                                        Профессиональный дартс SLP Elit-Play по выгодной цене                                                    ",
                    "link": true
                },
                {
                    "image": "Premium-SLP-1469_06.jpg",
                    "name": "\n                                                        Мини-футбол Premium. Профессионал, который украсит любой интерьер                                                    ",
                    "link": true
                },
                {
                    "image": "7e6ba6872b5d99bc01f2aebb2977123a.jpg",
                    "name": "\n                                                        Olympic Optima – новый теннисный стол, отличный от стандартов!                                                    ",
                    "link": true
                },
                {
                    "image": "2020_Home_00.jpg",
                    "name": "\n                                                        Home  - новый профессиональный мини-футбол!                                                    ",
                    "link": true
                },
                {
                    "image": "2020_Tournament_06.jpg",
                    "name": "\n                                                        Tournament  -  большой мини-футбол профессионального уровня!                                                    ",
                    "link": true
                },
                {
                    "image": "Perfect-SLF-JK30.jpg",
                    "name": "\n                                                        Беговая дорожка Perfect в сложенном виде занимает минимум пространства!                                                    ",
                    "link": true
                },
                {
                    "image": "Ice_transform_SLP_00.jpg",
                    "name": "\n                                                        Transform Ice. Популярная модель компактного аэрохоккея                                                    ",
                    "link": true
                },
                {
                    "image": "Ice_Arena-6_SLP-6030-1_заставка.jpg",
                    "name": "\n                                                        Аэрохоккей ICE ARENA 7. Большой стол в современном дизайне                                                    ",
                    "link": true
                },
                {
                    "image": "Universal-SLP-1225_00.jpg",
                    "name": "\n                                                        Аэрохоккей + Бильярд. Universal. Популярная модель компактного игрового стола                                                    ",
                    "link": true
                },
                {
                    "image": "2018_SLP_Elit-Play_BL-1818A_01.jpg",
                    "name": "\n                                                        Профессиональный дартс SLP Elit-Play по выгодной цене                                                    ",
                    "link": true
                }
            ]
        }, {
            name: "Интерьер",
            items: [
                {
                    "image": "Стол_винтаж.jpg",
                    "name": "\n                                                        «Винтаж»                                                    ",
                    "link": true
                },
                {
                    "image": "Диван_ампир.jpg",
                    "name": "\n                                                        Диван «Ампир»                                                    ",
                    "link": true
                },
                {
                    "image": "Маркиз_II_коллекции_1920х1080.jpg",
                    "name": "\n                                                        Серия «Маркиз II»                                                    ",
                    "link": true
                },
                {
                    "image": "Кресло_Лео.jpg",
                    "name": "\n                                                        Кресло «Лео»                                                    ",
                    "link": true
                },
                {
                    "image": "Тумба-Краколет.jpg",
                    "name": "\n                                                        Тумба «Ливерпуль-Краколет»                                                    ",
                    "link": true
                },
                {
                    "image": "Стол_винтаж.jpg",
                    "name": "\n                                                        «Винтаж»                                                    ",
                    "link": true
                },
                {
                    "image": "Диван_ампир.jpg",
                    "name": "\n                                                        Диван «Ампир»                                                    ",
                    "link": true
                },
                {
                    "image": "Маркиз_II_коллекции_1920х1080.jpg",
                    "name": "\n                                                        Серия «Маркиз II»                                                    ",
                    "link": true
                },
                {
                    "image": "Кресло_Лео.jpg",
                    "name": "\n                                                        Кресло «Лео»                                                    ",
                    "link": true
                },
                {
                    "image": "Тумба-Краколет.jpg",
                    "name": "\n                                                        Тумба «Ливерпуль-Краколет»                                                    ",
                    "link": true
                },
                {
                    "image": "Стол_винтаж.jpg",
                    "name": "\n                                                        «Винтаж»                                                    ",
                    "link": true
                },
                {
                    "image": "Диван_ампир.jpg",
                    "name": "\n                                                        Диван «Ампир»                                                    ",
                    "link": true
                },
                {
                    "image": "Маркиз_II_коллекции_1920х1080.jpg",
                    "name": "\n                                                        Серия «Маркиз II»                                                    ",
                    "link": true
                }
            ]
        }
    ])


    const [carefull, setCarefull] = useState([
        {
            name: "Бильярд",
            items: [
                {
                    "image": "66807_273x227_974badd7c31f7dd92634cac4548ca95a.jpg",
                    "name": "\n                                                    Узнайте подробнее о преимуществах бильярдных столов «Старт»                                                "
                },
                {
                    "image": "66799_273x227_00a3496bf2a5b542bd15a270ab10132e.jpg",
                    "name": "\n                                                    Скачайте буклет бильярдных светильников ФС «ГОРИЗОНТ» в pdf, 12Мб                                                "
                },
                {
                    "image": "66798_273x227_47fee60981d0fe7f31b9cdf393443903.jpg",
                    "name": "\n                                                    Скачайте буклет бильярдных киев «РУССКИЙ» в pdf, 7,7Мб                                                "
                },
                {
                    "image": "67018_273x227_604ba9e1e8e5779967c5ccec625ba6cc.jpg",
                    "name": "\n                                                    Фабрика «СТАРТ». Официальное видео                                                "
                },
                {
                    "image": "95733_273x227_82633eb9ce2ed17c4aeadeb78e1876a2.jpg",
                    "name": "\n                                                    В салонах Фабрики «Старт» проходит акция!                                                  "
                },
                {
                    "image": "94153_273x227_ecd06dc46c2ba6cf5e0e6acbf11baf98.jpg",
                    "name": "\n                                                    Фабрика «Старт» - официальный технический партнер «BetBoom Кубок Чемпионов»-2023                                                "
                },
                {
                    "image": "95713_273x227_0efa783141f6edce064b73f3269a50a6.jpg",
                    "name": "\n                                                    Фабрика «Старт» – единственный дистрибьютор оригинальной продукции Turning Point на территории России и стран СНГ                                                "
                },
                {
                    "image": "94667_273x227_cabba49c4e509368f2b843a4eade2d1b.jpg",
                    "name": "\n                                                    Фабрика «Старт» - официальный технический партнер «Кубка мира / Динамичная пирамида»-2023                                                "
                },
                {
                    "image": "93313_273x227_1761d1fa685d019888541f224037b887.png",
                    "name": "\n                                                    Архитектурно-дизайнерское бюро START DESIGN                                                "
                },
                {
                    "image": "94038_273x227_78d3632b056dd40429a6b887b0a0b759.jpg",
                    "name": "\n                                                    Фабрика «Старт» - официальный технический партнер «Чемпионата мира / Свободная пирамида»-2023                                                "
                },
                {
                    "image": "93583_273x227_69deea5dbe553e1b91e604d43fed17c3.jpg",
                    "name": "\n                                                    Фабрика «Старт» - официальный технический партнер «Чемпионата России по снукеру»-2023                                                "
                },
                {
                    "image": "92087_273x227_bd7ea29001657a65c20e576e1ccb4d05.jpg",
                    "name": "\n                                                    Фабрика «Старт» - официальный технический партнер «BetBoom Лига Чемпионов»-2022/23                                                "
                },
                {
                    "image": "68471_273x227_b9dc50663eab8d4d917fb6893cd63f62.jpg",
                    "name": "\n                                                    Фабрика «Старт» дает возможность купить бильярдный стол  по стоковой цене                                                "
                },
                {
                    "image": "90587_273x227_0f76eed10ee8aee7ef07d25a4ad2b5dc.jpg",
                    "name": "\n                                                    Звезды о столах Фабрики «Старт»                                                "
                },
                {
                    "image": "79728_273x227_206972caa04ef826324b56fbe17e0442.jpg",
                    "name": "\n                                                    У Фабрики «Старт» – столы чемпионов!                                                "
                },
                {
                    "image": "80190_273x227_3e6bc9a21a595a63683843d53ededa8a.jpg",
                    "name": "\n                                                    SUPER STONE. Официальные плиты четырех чемпионатов мира.                                                "
                },
                {
                    "image": "66788_273x227_de53fbc9c4bc7da13a75be339542f5bb.jpg",
                    "name": "\n                                                    Скачайте каталог продукции Фабрики «Старт» в pdf, 29Мб                                                "
                },
                {
                    "image": "86125_273x227_ad979c48e53789b40887048d35a5976c.jpg",
                    "name": "\n                                                    Сукно Manchester 70. Это прорыв по качеству и цене!                                                "
                },
                {
                    "image": "86126_273x227_0638d60b1df4a8a50f21073455e76137.jpg",
                    "name": "\n                                                    Сукно Manchester 60. Выбирайте лучшее соотношение цены и качества!                                                "
                },
                {
                    "image": "66803_273x227_ab551710644b39660f156faf07e34016.jpg",
                    "name": "\n                                                    Ваш отклик будет  персонально рассмотрен Директором Фабрики «Старт»                                                "
                },
                {
                    "image": "66807_273x227_974badd7c31f7dd92634cac4548ca95a.jpg",
                    "name": "\n                                                    Узнайте подробнее о преимуществах бильярдных столов «Старт»                                                "
                },
                {
                    "image": "66799_273x227_00a3496bf2a5b542bd15a270ab10132e.jpg",
                    "name": "\n                                                    Скачайте буклет бильярдных светильников ФС «ГОРИЗОНТ» в pdf, 12Мб                                                "
                },
                {
                    "image": "66798_273x227_47fee60981d0fe7f31b9cdf393443903.jpg",
                    "name": "\n                                                    Скачайте буклет бильярдных киев «РУССКИЙ» в pdf, 7,7Мб                                                "
                },
                {
                    "image": "67018_273x227_604ba9e1e8e5779967c5ccec625ba6cc.jpg",
                    "name": "\n                                                    Фабрика «СТАРТ». Официальное видео                                                "
                },
                {
                    "image": "95733_273x227_82633eb9ce2ed17c4aeadeb78e1876a2.jpg",
                    "name": "\n                                                    В салонах Фабрики «Старт» проходит акция!                                                  "
                },
                {
                    "image": "94153_273x227_ecd06dc46c2ba6cf5e0e6acbf11baf98.jpg",
                    "name": "\n                                                    Фабрика «Старт» - официальный технический партнер «BetBoom Кубок Чемпионов»-2023                                                "
                },
                {
                    "image": "95713_273x227_0efa783141f6edce064b73f3269a50a6.jpg",
                    "name": "\n                                                    Фабрика «Старт» – единственный дистрибьютор оригинальной продукции Turning Point на территории России и стран СНГ                                                "
                },
                {
                    "image": "94667_273x227_cabba49c4e509368f2b843a4eade2d1b.jpg",
                    "name": "\n                                                    Фабрика «Старт» - официальный технический партнер «Кубка мира / Динамичная пирамида»-2023                                                "
                }
            ]
        }, {
            name: "Игротека",
            items: [
                {
                    "image": "79159_273x227_cdfd7049939de7ccbddc388e14c12d9f.jpg",
                    "name": "\n                                                    Новый всепогодный теннисный стол с уникальным механизмом трансформации.                                                "
                },
                {
                    "image": "79160_273x227_4f4b533e2940e078bf96828a3aa1994b.jpg",
                    "name": "\n                                                    Start Line презентовал новый компактный стол для настольного тенниса                                                 "
                },
                {
                    "image": "74320_273x227_fa2cc7778b09e8145db198dd918f45dd.jpg",
                    "name": "\n                                                    Новый раздел товаров для игры в дартс Start Line Play в нашей игротеке                                                "
                },
                {
                    "image": "74704_273x227_17a61adcfc3b69539c2f5ecb07d49269.jpg",
                    "name": "\n                                                    Start Grill. Керамические грили и аксессуары для гриля                                                "
                },
                {
                    "image": "82314_273x227_c52e7047e59e27b2c73996378ca49b64.jpg",
                    "name": "\n                                                    Каталог теннисных столов и аксессуаров в pdf, 11 Мб                                                "
                },
                {
                    "image": "82312_273x227_4b574bc8123039b210e3465ad53a0d6c.jpg",
                    "name": "\n                                                    Каталог товаров для СПОРТА / ОТДЫХА / ИГРЫ в pdf, 15 Мб                                                "
                },
                {
                    "image": "72287_273x227_a43d29292cb74eaa171f422267cc4edd.jpg",
                    "name": "\n                                                    Теннисные столы Start Line. Инструкция по сборке.                                                "
                },
                {
                    "image": "78507_273x227_b2f48568b650dc6d454c57e1849a7673.jpg",
                    "name": "\n                                                    Продукция Start Line находятся в составе лицензированных и рекомендованных Международная Федерация настольного тенниса (ITTF).                                                "
                },
                {
                    "image": "80650_273x227_f9e53db974b1a37adc1ad8569a2576e2.jpg",
                    "name": "\n                                                    Start Line Fitness. Фитнес тренажеры нового поколения!                                                "
                },
                {
                    "image": "79159_273x227_cdfd7049939de7ccbddc388e14c12d9f.jpg",
                    "name": "\n                                                    Новый всепогодный теннисный стол с уникальным механизмом трансформации.                                                "
                },
                {
                    "image": "79160_273x227_4f4b533e2940e078bf96828a3aa1994b.jpg",
                    "name": "\n                                                    Start Line презентовал новый компактный стол для настольного тенниса                                                 "
                },
                {
                    "image": "74320_273x227_fa2cc7778b09e8145db198dd918f45dd.jpg",
                    "name": "\n                                                    Новый раздел товаров для игры в дартс Start Line Play в нашей игротеке                                                "
                },
                {
                    "image": "74704_273x227_17a61adcfc3b69539c2f5ecb07d49269.jpg",
                    "name": "\n                                                    Start Grill. Керамические грили и аксессуары для гриля                                                "
                },
                {
                    "image": "82314_273x227_c52e7047e59e27b2c73996378ca49b64.jpg",
                    "name": "\n                                                    Каталог теннисных столов и аксессуаров в pdf, 11 Мб                                                "
                },
                {
                    "image": "82312_273x227_4b574bc8123039b210e3465ad53a0d6c.jpg",
                    "name": "\n                                                    Каталог товаров для СПОРТА / ОТДЫХА / ИГРЫ в pdf, 15 Мб                                                "
                },
                {
                    "image": "72287_273x227_a43d29292cb74eaa171f422267cc4edd.jpg",
                    "name": "\n                                                    Теннисные столы Start Line. Инструкция по сборке.                                                "
                },
                {
                    "image": "78507_273x227_b2f48568b650dc6d454c57e1849a7673.jpg",
                    "name": "\n                                                    Продукция Start Line находятся в составе лицензированных и рекомендованных Международная Федерация настольного тенниса (ITTF).                                                "
                }
            ]
        }, {
            name: "Интерьер",
            items: [
                {
                    "image": "66827_273x227_ff876846335bdf2918d9599a503084ec.jpg",
                    "name": "\n                                                    Скачать каталог интерьерных панелей, в pdf 8,9Мб                                                "
                },
                {
                    "image": "71047_273x227_37cbb8bda06c8243702d120ef4c1b31b.jpg",
                    "name": "\n                                                    Интерьерные панели. Инструкция по сборке.                                                 "
                },
                {
                    "image": "67020_273x227_2bbff5e9cb868797378393b76f1c0c83.jpg",
                    "name": "\n                                                    Кессонный потолок. Инструкция по сборке.                                                 "
                },
                {
                    "image": "66825_273x227_c39f9327d56708aa5b6f88855133bc8d.jpg",
                    "name": "\n                                                    Скачать каталог мебельных модулей, в pdf 16,4Мб                                                "
                },
                {
                    "image": "66824_273x227_419543b32e5f1552539ef869415dd057.jpg",
                    "name": "\n                                                    Скачать каталог предметов мебели, в pdf 16,4Мб                                                "
                },
                {
                    "image": "66827_273x227_ff876846335bdf2918d9599a503084ec.jpg",
                    "name": "\n                                                    Скачать каталог интерьерных панелей, в pdf 8,9Мб                                                "
                },
                {
                    "image": "71047_273x227_37cbb8bda06c8243702d120ef4c1b31b.jpg",
                    "name": "\n                                                    Интерьерные панели. Инструкция по сборке.                                                 "
                },
                {
                    "image": "67020_273x227_2bbff5e9cb868797378393b76f1c0c83.jpg",
                    "name": "\n                                                    Кессонный потолок. Инструкция по сборке.                                                 "
                },
                {
                    "image": "66825_273x227_c39f9327d56708aa5b6f88855133bc8d.jpg",
                    "name": "\n                                                    Скачать каталог мебельных модулей, в pdf 16,4Мб                                                "
                },
                {
                    "image": "66824_273x227_419543b32e5f1552539ef869415dd057.jpg",
                    "name": "\n                                                    Скачать каталог предметов мебели, в pdf 16,4Мб                                                "
                },
                {
                    "image": "66827_273x227_ff876846335bdf2918d9599a503084ec.jpg",
                    "name": "\n                                                    Скачать каталог интерьерных панелей, в pdf 8,9Мб                                                "
                },
                {
                    "image": "71047_273x227_37cbb8bda06c8243702d120ef4c1b31b.jpg",
                    "name": "\n                                                    Интерьерные панели. Инструкция по сборке.                                                 "
                },
                {
                    "image": "67020_273x227_2bbff5e9cb868797378393b76f1c0c83.jpg",
                    "name": "\n                                                    Кессонный потолок. Инструкция по сборке.                                                 "
                }
            ]
        }
    ])


    return (
        <>
            <Predlagat data={startData} name={"Фабрика «Старт» предлагает"} />
            <Predlagat data={onlineShoppin} name={"Выгодные предложения онлайн-магазина"} />
            <Predlagat data={carefull} name={"Полезная информация"} />
        </>
    )
}

export default BigCarousel